# SetTileRepetitionPoint

## Description
Sets the specified tile resource's repetition point.

```pascal
PROCEDURE SetTileRepetitionPoint(
				tileHandle      : HANDLE;
				repetitionPoint : POINT);
```

```python
def vs.SetTileRepetitionPoint(tileHandle, repetitionPoint):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|tileHandle|HANDLE|The tile resource in which to set the repetition point.|
|repetitionPoint|POINT|The repetition point to be set.|

## Examples
```pascal
SetTileRepetitionPoint(tileHandle, repetitionPoint);
```

```pascal
SetTileRepetitionPoint(tileHandle, 1);
```
```python
import vs

# Sets the specified tile resource's repetition point.
tileHandle = vs.FSActLayer()  # handle to the first selected object on the active layer
repetitionPoint = (0, 0)

vs.SetTileRepetitionPoint(tileHandle, repetitionPoint)
```

## See Also
VS Functions:
CreateTile
| ShowEditTileDialog
| ShowEditTileSettingsDialog
| ShowNewTileDialog
| GetTileGeometryGroup
| BeginGroupN
| AddTileGeometryObject
| GetTileGroupParent
| IsTileGroupContainedObject
| GetTileBackgroundColor
| SetTileBackgroundColor
| GetTileRepetitionPoint
| SetTileRepetitionPoint
| GetTileOffsetPoint
| SetTileOffsetPoint

## Version
Availability: from Vectorworks 2011

## Category
* Document Attributes